Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SDADC.h
/*! @name VERID - Version ID */
/*! @{ */

#define SDADC_VERID_MINOR_MASK                   (0xFF0000U)
#define SDADC_VERID_MINOR_SHIFT                  (16U)
/*! MINOR - Minor Version Number */
#define SDADC_VERID_MINOR(x)                     (((uint32_t)(((uint32_t)(x)) << SDADC_VERID_MINOR_SHIFT)) & SDADC_VERID_MINOR_MASK)

#define SDADC_VERID_MAJOR_MASK                   (0xFF000000U)
#define SDADC_VERID_MAJOR_SHIFT                  (24U)
/*! MAJOR - Major Version Number */
#define SDADC_VERID_MAJOR(x)                     (((uint32_t)(((uint32_t)(x)) << SDADC_VERID_MAJOR_SHIFT)) & SDADC_VERID_MAJOR_MASK)
/*! @} */

/*! @name ADC_CTL_0 - ADC Control 0 */
/*! @{ */

#define SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_MASK    (0xFU)
#define SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_SHIFT   (0U)
/*! COMP_ADCN_ENABLE - Compensation ADCn Enable
 *  0b0xxx..Disables for ADCn[3]
 *  0b1xxx..Enables for ADCn[3]
 *  0bx0xx..Disables for ADCn[2]
 *  0bx1xx..Enables for ADCn[2]
 *  0bxx0x..Disables for ADCn[1]
 *  0bxx1x..Enables for ADCn[1]
 *  0bxxx0..Disables for ADCn[0]
 *  0bxxx1..Enables for ADCn[0]
 */
#define SDADC_ADC_CTL_0_COMP_ADCN_ENABLE(x)      (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_SHIFT)) & SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_MASK)

#define SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_MASK    (0xF0U)
#define SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_SHIFT   (4U)
/*! COMP_ADCP_ENABLE - Compensation ADCp Enable
 *  0b0xxx..Disables for ADCp[3]
 *  0b1xxx..Enables for ADCp[3]
 *  0bx0xx..Disables for ADCp[2]
 *  0bx1xx..Enables for ADCp[2]
 *  0bxx0x..Disables for ADCp[1]
 *  0bxx1x..Enables for ADCp[1]
 *  0bxxx0..Disables for ADCp[0]
 *  0bxxx1..Enables for ADCp[0]
 */
#define SDADC_ADC_CTL_0_COMP_ADCP_ENABLE(x)      (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_SHIFT)) & SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_MASK)

#define SDADC_ADC_CTL_0_RST_AN_ADCN_MASK         (0xF00U)
#define SDADC_ADC_CTL_0_RST_AN_ADCN_SHIFT        (8U)
/*! RST_AN_ADCN - Reset ADCn
 *  0b0xxx..Reset for ADCn[3]
 *  0b1xxx..Operational for ADCn[3]
 *  0bx0xx..Reset for ADCn[2]
 *  0bx1xx..Operational for ADCn[2]
 *  0bxx0x..Reset for ADCn[1]
 *  0bxx1x..Operational for ADCn[1]
 *  0bxxx0..Reset for ADCn[0]
 *  0bxxx1..Operational for ADCn[0]
 */
#define SDADC_ADC_CTL_0_RST_AN_ADCN(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_RST_AN_ADCN_SHIFT)) & SDADC_ADC_CTL_0_RST_AN_ADCN_MASK)

#define SDADC_ADC_CTL_0_RST_AN_ADCP_MASK         (0xF000U)
#define SDADC_ADC_CTL_0_RST_AN_ADCP_SHIFT        (12U)
/*! RST_AN_ADCP - Reset ADCp
 *  0b0xxx..Reset for ADCp[3]
 *  0b1xxx..Operational for ADCp[3]
 *  0bx0xx..Reset for ADCp[2]
 *  0bx1xx..Operational for ADCp[2]
 *  0bxx0x..Reset for ADCp[1]
 *  0bxx1x..Operational for ADCp[1]
 *  0bxxx0..Reset for ADCp[0]
 *  0bxxx1..Operational for ADCp[0]
 */
#define SDADC_ADC_CTL_0_RST_AN_ADCP(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_RST_AN_ADCP_SHIFT)) & SDADC_ADC_CTL_0_RST_AN_ADCP_MASK)

#define SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_MASK   (0xF000000U)
#define SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_SHIFT  (24U)
/*! ADCN_POWER_ENABLE - ADCn Power Enable
 *  0b0xxx..Disables ADCn[3] and vin_n[3]
 *  0b1xxx..Enables ADCn[3] and vin_n[3]
 *  0bx0xx..Disables ADCn[2] and vin_n[2]
 *  0bx1xx..Enables ADCn[2] and vin_n[2]
 *  0bxx0x..Disables ADCn[1] and vin_n[1]
 *  0bxx1x..Enables ADCn[1] and vin_n[1]
 *  0bxxx0..Disables ADCn[0] and vin_n[0]
 *  0bxxx1..Enables ADCn[0] and vin_n[0]
 */
#define SDADC_ADC_CTL_0_ADCN_POWER_ENABLE(x)     (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_SHIFT)) & SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_MASK)

#define SDADC_ADC_CTL_0_ADCP_POWER_ENABLE_MASK   (0xF0000000U)
#define SDADC_ADC_CTL_0_ADCP_POWER_ENABLE_SHIFT  (28U)
/*! ADCP_POWER_ENABLE - ADCp Power Enable
 *  0b0xxx..Disables ADCp[3] and vin_p[3]
 *  0b1xxx..Enables ADCp[3] and vin_p[3]
 *  0bx0xx..Disables ADCp[2] and vin_p[2]
 *  0bx1xx..Enables ADCp[2] and vin_p[2]
 *  0bxx0x..Disables ADCp[1] and vin_p[1]
 *  0bxx1x..Enables ADCp[1] and vin_p[1]
 *  0bxxx0..Disables ADCp[0] and vin_p[0]
 *  0bxxx1..Enables ADCp[0] and vin_p[0]
 */
#define SDADC_ADC_CTL_0_ADCP_POWER_ENABLE(x)     (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_ADCP_POWER_ENABLE_SHIFT)) & SDADC_ADC_CTL_0_ADCP_POWER_ENABLE_MASK)
/*! @} */

/*! @name ADC_CTL_1 - ADC Control 1 */
/*! @{ */

#define SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE_MASK (0xF00U)
#define SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE_SHIFT (8U)
/*! DCLOOP_N_ANA_ENABLE - DC Loop N Analog Enable
 *  0b0xxx..Disables for ADCn[3]
 *  0b1xxx..Enables for ADCn[3]
 *  0bx0xx..Disables for ADCn[2]
 *  0bx1xx..Enables for ADCn[2]
 *  0bxx0x..Disables for ADCn[1]
 *  0bxx1x..Enables for ADCn[1]
 *  0bxxx0..Disables for ADCn[0]
 *  0bxxx1..Enables for ADCn[0]
 */
#define SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE_SHIFT)) & SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE_MASK)

#define SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE_MASK (0xF000U)
#define SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE_SHIFT (12U)
/*! DCLOOP_P_ANA_ENABLE - DC Loop P Analog Enable
 *  0b0xxx..Disables for ADCp[3]
 *  0b1xxx..Enables for ADCp[3]
 *  0bx0xx..Disables for ADCp[2]
 *  0bx1xx..Enables for ADCp[2]
 *  0bxx0x..Disables for ADCp[1]
 *  0bxx1x..Enables for ADCp[1]
 *  0bxxx0..Disables for ADCp[0]
 *  0bxxx1..Enables for ADCp[0]
 */
#define SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE_SHIFT)) & SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE_MASK)

#define SDADC_ADC_CTL_1_DIFF_ENABLE_MASK         (0xF000000U)
#define SDADC_ADC_CTL_1_DIFF_ENABLE_SHIFT        (24U)
/*! DIFF_ENABLE - Diff Enable
 *  0b0xxx..ADCp[3] and ADCn[3] in SE mode
 *  0b1xxx..Configures ADCp[3] and ADCn[3] as differential pair input
 *  0bx0xx..ADCp[2] and ADCn[2] in SE mode
 *  0bx1xx..Configures ADCp[2] and ADCn[2] as differential pair input
 *  0bxx0x..ADCp[1] and ADCn[1] in SE mode
 *  0bxx1x..Configures ADCp[1] and ADCn[1] as differential pair input
 *  0bxxx0..ADCp[0] and ADCn[0] in SE mode
 *  0bxxx1..Configures ADCp[0] and ADCn[0] as differential pair input
 */
#define SDADC_ADC_CTL_1_DIFF_ENABLE(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_1_DIFF_ENABLE_SHIFT)) & SDADC_ADC_CTL_1_DIFF_ENABLE_MASK)
/*! @} */

/*! @name ADC_CTL_2 - ADC Control 2 */
/*! @{ */

#define SDADC_ADC_CTL_2_SET_DITHER3_MASK         (0x70000U)
#define SDADC_ADC_CTL_2_SET_DITHER3_SHIFT        (16U)
/*! SET_DITHER3 - Set Dither 3
 *  0b000..Disables dither of ADCp[3] and ADCn[3].
 *  0b001-0b110..The higher the value, the stronger the dither
 *  0b111..Maximum dither amplitude for ADCp[3] and ADCn[3]
 */
#define SDADC_ADC_CTL_2_SET_DITHER3(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_2_SET_DITHER3_SHIFT)) & SDADC_ADC_CTL_2_SET_DITHER3_MASK)

