Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SDADC.h
#define SDADC_ADC_CTL_2_SET_DITHER2_MASK         (0x700000U)
#define SDADC_ADC_CTL_2_SET_DITHER2_SHIFT        (20U)
/*! SET_DITHER2 - Set Dither 2
 *  0b000..Disables dither of ADCp[2] and ADCn[2]
 *  0b001-0b110..The higher the value, the stronger the dither
 *  0b111..Maximum dither amplitude for ADCp[2] and ADCn[2]
 */
#define SDADC_ADC_CTL_2_SET_DITHER2(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_2_SET_DITHER2_SHIFT)) & SDADC_ADC_CTL_2_SET_DITHER2_MASK)

#define SDADC_ADC_CTL_2_SET_DITHER1_MASK         (0x7000000U)
#define SDADC_ADC_CTL_2_SET_DITHER1_SHIFT        (24U)
/*! SET_DITHER1 - Set Dither 1
 *  0b000..Disables dither of ADCp[1] and ADCn[1]
 *  0b001-0b110..The higher the value, the stronger the dither
 *  0b111..Maximum dither amplitude for ADCp[1] and ADCn[1]
 */
#define SDADC_ADC_CTL_2_SET_DITHER1(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_2_SET_DITHER1_SHIFT)) & SDADC_ADC_CTL_2_SET_DITHER1_MASK)

#define SDADC_ADC_CTL_2_SET_DITHER0_MASK         (0x70000000U)
#define SDADC_ADC_CTL_2_SET_DITHER0_SHIFT        (28U)
/*! SET_DITHER0 - Set Dither 0
 *  0b000..Disables dither of ADCp[0] and ADCn[0]
 *  0b001-0b110..The higher the value, the stronger the dither
 *  0b111..Maximum dither amplitude for ADCp[0] and ADCn[0]
 */
#define SDADC_ADC_CTL_2_SET_DITHER0(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_2_SET_DITHER0_SHIFT)) & SDADC_ADC_CTL_2_SET_DITHER0_MASK)
/*! @} */

/*! @name LDO_CTL - LDO Control */
/*! @{ */

#define SDADC_LDO_CTL_LDO_SETTING_MASK           (0x3000U)
#define SDADC_LDO_CTL_LDO_SETTING_SHIFT          (12U)
/*! LDO_SETTING - LDO Setting
 *  0b00..To drive 1 SE or 1 Diff mode ADC (low power mode)
 *  0b01..To drive more than 1 ADCs
 *  0b10, 0b11..Not in use
 */
#define SDADC_LDO_CTL_LDO_SETTING(x)             (((uint32_t)(((uint32_t)(x)) << SDADC_LDO_CTL_LDO_SETTING_SHIFT)) & SDADC_LDO_CTL_LDO_SETTING_MASK)

#define SDADC_LDO_CTL_LDO_POWER_ENABLE_MASK      (0x100000U)
#define SDADC_LDO_CTL_LDO_POWER_ENABLE_SHIFT     (20U)
/*! LDO_POWER_ENABLE - LDO Power Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SDADC_LDO_CTL_LDO_POWER_ENABLE(x)        (((uint32_t)(((uint32_t)(x)) << SDADC_LDO_CTL_LDO_POWER_ENABLE_SHIFT)) & SDADC_LDO_CTL_LDO_POWER_ENABLE_MASK)
/*! @} */

/*! @name REF_CTL - Reference Control */
/*! @{ */

#define SDADC_REF_CTL_FAST_REF_ENABLE_MASK       (0x10000U)
#define SDADC_REF_CTL_FAST_REF_ENABLE_SHIFT      (16U)
/*! FAST_REF_ENABLE - Fast Reference Enable
 *  0b0..267 ms (retain mode) when bit20=0 | 38 ms (low noise) when bit20=1
 *  0b1..66.5 ms (low power) when bit20=0 | 1 ms (fast charging) when bit20=1
 */
#define SDADC_REF_CTL_FAST_REF_ENABLE(x)         (((uint32_t)(((uint32_t)(x)) << SDADC_REF_CTL_FAST_REF_ENABLE_SHIFT)) & SDADC_REF_CTL_FAST_REF_ENABLE_MASK)

#define SDADC_REF_CTL_PWR_FAST_REF_ENABLE_MASK   (0x100000U)
#define SDADC_REF_CTL_PWR_FAST_REF_ENABLE_SHIFT  (20U)
/*! PWR_FAST_REF_ENABLE - Power Fast Reference Enable
 *  0b0..267 ms (retain mode) when bit16=0 | 66.5 ms (low power) when bit16=1
 *  0b1..38 ms (low noise) when bit16=0 | 1 ms (fast charging) when bit16=1
 */
#define SDADC_REF_CTL_PWR_FAST_REF_ENABLE(x)     (((uint32_t)(((uint32_t)(x)) << SDADC_REF_CTL_PWR_FAST_REF_ENABLE_SHIFT)) & SDADC_REF_CTL_PWR_FAST_REF_ENABLE_MASK)

#define SDADC_REF_CTL_REF_POWER_ENABLE_MASK      (0x10000000U)
#define SDADC_REF_CTL_REF_POWER_ENABLE_SHIFT     (28U)
/*! REF_POWER_ENABLE - Reference Power Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SDADC_REF_CTL_REF_POWER_ENABLE(x)        (((uint32_t)(((uint32_t)(x)) << SDADC_REF_CTL_REF_POWER_ENABLE_SHIFT)) & SDADC_REF_CTL_REF_POWER_ENABLE_MASK)
/*! @} */

/*! @name DECIMATOR_CTL_0 - Decimator Control 0 */
/*! @{ */

#define SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE_MASK (0xF00U)
#define SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE_SHIFT (8U)
/*! POL_INV_P_ENABLE - Polarity Inverter P Enable
 *  0b0xxx..Disables at Decimator_p[3]
 *  0b1xxx..Enables at Decimator_p[3]
 *  0bx0xx..Disables at Decimator_p[2]
 *  0bx1xx..Enables at Decimator_p[2]
 *  0bxx0x..Disables at Decimator_p[1]
 *  0bxx1x..Enables at Decimator_p[1]
 *  0bxxx0..Disables at Decimator_p[0]
 *  0bxxx1..Enables at Decimator_p[0]
 */
#define SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE_SHIFT)) & SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE_MASK)

#define SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE_MASK (0xF000U)
#define SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE_SHIFT (12U)
/*! POL_INV_N_ENABLE - Polarity Inverter N Enable
 *  0b0xxx..Disables at Decimator_n[3]
 *  0b1xxx..Enables at Decimator_n[3]
 *  0bx0xx..Disables at Decimator_n[2]
 *  0bx1xx..Enables at Decimator_n[2]
 *  0bxx0x..Disables at Decimator_n[1]
 *  0bxx1x..Enables at Decimator_n[1]
 *  0bxxx0..Disables at Decimator_n[0]
 *  0bxxx1..Enables at Decimator_n[0]
 */
#define SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE_SHIFT)) & SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE_MASK)

#define SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE_MASK (0xF000000U)
#define SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE_SHIFT (24U)
/*! DCFILTI_P_ENABLE - Decimation Filter Input P Enable
 *  0b0xxx..Disables at Decimator_p[3]
 *  0b1xxx..Enables at Decimator_p[3]
 *  0bx0xx..Disables at Decimator_p[2]
 *  0bx1xx..Enables at Decimator_p[2]
 *  0bxx0x..Disables at Decimator_p[1]
 *  0bxx1x..Enables at Decimator_p[1]
 *  0bxxx0..Disables at Decimator_p[0]
 *  0bxxx1..Enables at Decimator_p[0]
 */
#define SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE_SHIFT)) & SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE_MASK)

#define SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE_MASK (0xF0000000U)
#define SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE_SHIFT (28U)
/*! DCFILTI_N_ENABLE - Decimation Filter Input N Enable
 *  0b0xxx..Disables at Decimator_n[3]
 *  0b1xxx..Enables at Decimator_n[3]
 *  0bx0xx..Disables at Decimator_n[2]
 *  0bx1xx..Enables at Decimator_n[2]
 *  0bxx0x..Disables at Decimator_n[1]
 *  0bxx1x..Enables at Decimator_n[1]
 *  0bxxx0..Disables at Decimator_n[0]
 *  0bxxx1..Enables at Decimator_n[0]
 */
#define SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE_SHIFT)) & SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE_MASK)
/*! @} */

/*! @name DECIMATOR_CTL_1 - Decimator Control 1 */
/*! @{ */

#define SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P_MASK (0xF00U)
#define SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P_SHIFT (8U)
/*! FUNC_LOCAL_RST_AN_DEC_P - Functional Local Reset for Decimator P
 *  0b0xxx..Reset for Decimator_p[3]
 *  0b1xxx..Operational for Decimator_p[3]
 *  0bx0xx..Reset for Decimator_p[2]
 *  0bx1xx..Operational for Decimator_p2]
 *  0bxx0x..Reset for Decimator_p[1]
 *  0bxx1x..Operational for Decimator_p[1]
 *  0bxxx0..Reset for Decimator_p[0]
 *  0bxxx1..Operational for Decimator_p[0]
 */
#define SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P(x) (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P_SHIFT)) & SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P_MASK)

#define SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N_MASK (0xF000U)
#define SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N_SHIFT (12U)
/*! FUNC_LOCAL_RST_AN_DEC_N - Functional Local Reset for Decimator N
 *  0b0xxx..Reset for Decimator_n[3]
 *  0b1xxx..Operational for Decimator_n[3]
 *  0bx0xx..Reset for Decimator_n[2]
 *  0bx1xx..Operational for Decimator_n[2]
 *  0bxx0x..Reset for Decimator_n[1]
 *  0bxx1x..Operational for Decimator_n[1]
 *  0bxxx0..Reset for Decimator_n[0]
 *  0bxxx1..Operational for Decimator_n[0]
 */
#define SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N(x) (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N_SHIFT)) & SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N_MASK)
/*! @} */

/*! @name DECIMATOR_CTL_2 - Decimator Control 2 */
/*! @{ */

#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_0_MASK  (0xFFU)
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_0_SHIFT (0U)
/*! VOL_CTRL_P_0 - Volume Control P 0 */
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_0(x)    (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_0_SHIFT)) & SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_0_MASK)

