Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SDADC.h
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_0_MASK  (0xFF00U)
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_0_SHIFT (8U)
/*! VOL_CTRL_N_0 - Volume Control N 0 */
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_0(x)    (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_0_SHIFT)) & SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_0_MASK)

#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_1_MASK  (0xFF0000U)
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_1_SHIFT (16U)
/*! VOL_CTRL_P_1 - Volume Control P 1 */
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_1(x)    (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_1_SHIFT)) & SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_1_MASK)

#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_1_MASK  (0xFF000000U)
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_1_SHIFT (24U)
/*! VOL_CTRL_N_1 - Volume Control N 1 */
#define SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_1(x)    (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_1_SHIFT)) & SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_1_MASK)
/*! @} */

/*! @name DECIMATOR_CTL_3 - Decimator Control 3 */
/*! @{ */

#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_2_MASK  (0xFFU)
#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_2_SHIFT (0U)
/*! VOL_CTRL_P_2 - Volume Control P 2 */
#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_2(x)    (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_2_SHIFT)) & SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_2_MASK)

#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_2_MASK  (0xFF00U)
#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_2_SHIFT (8U)
/*! VOL_CTRL_N_2 - Volume Control N 2 */
#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_2(x)    (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_2_SHIFT)) & SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_2_MASK)

#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_3_MASK  (0xFF0000U)
#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_3_SHIFT (16U)
/*! VOL_CTRL_P_3 - Volume Control P 3 */
#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_3(x)    (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_3_SHIFT)) & SDADC_DECIMATOR_CTL_3_VOL_CTRL_P_3_MASK)

#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_3_MASK  (0xFF000000U)
#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_3_SHIFT (24U)
/*! VOL_CTRL_N_3 - Volume Control N 3 */
#define SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_3(x)    (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_3_SHIFT)) & SDADC_DECIMATOR_CTL_3_VOL_CTRL_N_3_MASK)
/*! @} */

/*! @name DECIMATOR_CTL_4 - Decimator Control 4 */
/*! @{ */

#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_0_MASK (0x3U)
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_0_SHIFT (0U)
/*! SET_SPEED_P_0 - Set Speed P 0
 *  0b00..48 kHz
 *  0b01..32 kHz
 *  0b10..16 kHz
 *  0b11..48 kHz
 */
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_0(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_4_SET_SPEED_P_0_SHIFT)) & SDADC_DECIMATOR_CTL_4_SET_SPEED_P_0_MASK)

#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_0_MASK (0xCU)
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_0_SHIFT (2U)
/*! SET_SPEED_N_0 - Set Speed N 0
 *  0b00..48 kHz
 *  0b01..32 kHz
 *  0b10..16 kHz
 *  0b11..48 kHz
 */
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_0(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_4_SET_SPEED_N_0_SHIFT)) & SDADC_DECIMATOR_CTL_4_SET_SPEED_N_0_MASK)

#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_1_MASK (0x30U)
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_1_SHIFT (4U)
/*! SET_SPEED_P_1 - Set Speed P 1
 *  0b00..48 kHz
 *  0b01..32 kHz
 *  0b10..16 kHz
 *  0b11..48 kHz
 */
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_1(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_4_SET_SPEED_P_1_SHIFT)) & SDADC_DECIMATOR_CTL_4_SET_SPEED_P_1_MASK)

#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_1_MASK (0xC0U)
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_1_SHIFT (6U)
/*! SET_SPEED_N_1 - Set Speed N 1
 *  0b00..48 kHz
 *  0b01..32 kHz
 *  0b10..16 kHz
 *  0b11..48 kHz
 */
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_1(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_4_SET_SPEED_N_1_SHIFT)) & SDADC_DECIMATOR_CTL_4_SET_SPEED_N_1_MASK)

#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_2_MASK (0x300U)
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_2_SHIFT (8U)
/*! SET_SPEED_P_2 - Set Speed P 2
 *  0b00..48 kHz
 *  0b01..32 kHz
 *  0b10..16 kHz
 *  0b11..48 kHz
 */
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_2(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_4_SET_SPEED_P_2_SHIFT)) & SDADC_DECIMATOR_CTL_4_SET_SPEED_P_2_MASK)

#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_2_MASK (0xC00U)
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_2_SHIFT (10U)
/*! SET_SPEED_N_2 - Set Speed N 2
 *  0b00..48 kHz
 *  0b01..32 kHz
 *  0b10..16 kHz
 *  0b11..48 kHz
 */
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_2(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_4_SET_SPEED_N_2_SHIFT)) & SDADC_DECIMATOR_CTL_4_SET_SPEED_N_2_MASK)

#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_3_MASK (0x3000U)
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_3_SHIFT (12U)
/*! SET_SPEED_P_3 - Set Speed P 3
 *  0b00..48 kHz
 *  0b01..32 kHz
 *  0b10..16 kHz
 *  0b11..48 kHz
 */
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_P_3(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_4_SET_SPEED_P_3_SHIFT)) & SDADC_DECIMATOR_CTL_4_SET_SPEED_P_3_MASK)

#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_3_MASK (0xC000U)
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_3_SHIFT (14U)
/*! SET_SPEED_N_3 - Set Speed N 3
 *  0b00..48 kHz
 *  0b01..32 kHz
 *  0b10..16 kHz
 *  0b11..48 kHz
 */
#define SDADC_DECIMATOR_CTL_4_SET_SPEED_N_3(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DECIMATOR_CTL_4_SET_SPEED_N_3_SHIFT)) & SDADC_DECIMATOR_CTL_4_SET_SPEED_N_3_MASK)
/*! @} */

/*! @name DC_LOOP_CTL_0 - DC Loop Control 0 */
/*! @{ */

#define SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE_MASK (0xFU)
#define SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE_SHIFT (0U)
/*! DCLOOP_P_ENABLE - DC Loop P Enable
 *  0b0xxx..Disables filter_p[3]
 *  0b1xxx..Enables filter_p[3]
 *  0bx0xx..Disables filter_p[2]
 *  0bx1xx..Enables filter_p[2]
 *  0bxx0x..Disables filter_p[1]
 *  0bxx1x..Enables filter_p[1]
 *  0bxxx0..Disables filter_p[0]
 *  0bxxx1..Enables filter_p[0]
 */
#define SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE_SHIFT)) & SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE_MASK)

