Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SDADC.h
#define SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE_MASK (0xF0U)
#define SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE_SHIFT (4U)
/*! DCLOOP_N_ENABLE - DC Loop N Enable
 *  0b0xxx..Disables filter_n[3]
 *  0b1xxx..Enables filter_n[3]
 *  0bx0xx..Disables filter_n[2]
 *  0bx1xx..Enables filter_n[2]
 *  0bxx0x..Disables filter_n[1]
 *  0bxx1x..Enables filter_n[1]
 *  0bxxx0..Disables filter_n[0]
 *  0bxxx1..Enables filter_n[0]
 */
#define SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE_SHIFT)) & SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE_MASK)
/*! @} */

/*! @name DC_LOOP_CTL_1 - DC Loop Control 1 */
/*! @{ */

#define SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P_MASK (0xFU)
#define SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P_SHIFT (0U)
/*! FUNC_LOCAL_RST_AN_DCLOOP_P - Functional Local Reset DCloop_p
 *  0b0xxx..Reset for ADCp[3]
 *  0b1xxx..Operational for ADCp[3]
 *  0bx0xx..Reset for ADCp[2]
 *  0bx1xx..Operational for ADCp[2]
 *  0bxx0x..Reset for ADCp[1]
 *  0bxx1x..Operational for ADCp[1]
 *  0bxxx0..Reset for ADCp[0]
 *  0bxxx1..Operational for ADCp[0]
 */
#define SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P(x) (((uint32_t)(((uint32_t)(x)) << SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P_SHIFT)) & SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P_MASK)

#define SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N_MASK (0xF0U)
#define SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N_SHIFT (4U)
/*! FUNC_LOCAL_RST_AN_DCLOOP_N - Functional Local Reset DCloop_n
 *  0b0xxx..Reset for ADCn[3]
 *  0b1xxx..Operational for ADCn[3]
 *  0bx0xx..Reset for ADCn[2]
 *  0bx1xx..Operational for ADCn[2]
 *  0bxx0x..Reset for ADCn[1]
 *  0bxx1x..Operational for ADCn[1]
 *  0bxxx0..Reset for ADCn[0]
 *  0bxxx1..Operational for ADCn[0]
 */
#define SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N(x) (((uint32_t)(((uint32_t)(x)) << SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N_SHIFT)) & SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N_MASK)
/*! @} */

/*! @name FIFO_WR_RD_CTL - FIFO Write Read Control */
/*! @{ */

#define SDADC_FIFO_WR_RD_CTL_WR_0_P_RST_MASK     (0x10000U)
#define SDADC_FIFO_WR_RD_CTL_WR_0_P_RST_SHIFT    (16U)
/*! WR_0_P_RST - Write Reset for FIFO_0_P */
#define SDADC_FIFO_WR_RD_CTL_WR_0_P_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_WR_0_P_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_WR_0_P_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_RD_0_P_RST_MASK     (0x20000U)
#define SDADC_FIFO_WR_RD_CTL_RD_0_P_RST_SHIFT    (17U)
/*! RD_0_P_RST - Read Reset for FIFO_0_P */
#define SDADC_FIFO_WR_RD_CTL_RD_0_P_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_RD_0_P_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_RD_0_P_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_WR_0_N_RST_MASK     (0x40000U)
#define SDADC_FIFO_WR_RD_CTL_WR_0_N_RST_SHIFT    (18U)
/*! WR_0_N_RST - Write Reset for FIFO_0_N */
#define SDADC_FIFO_WR_RD_CTL_WR_0_N_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_WR_0_N_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_WR_0_N_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_RD_0_N_RST_MASK     (0x80000U)
#define SDADC_FIFO_WR_RD_CTL_RD_0_N_RST_SHIFT    (19U)
/*! RD_0_N_RST - Read Reset for FIFO_0_N */
#define SDADC_FIFO_WR_RD_CTL_RD_0_N_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_RD_0_N_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_RD_0_N_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_WR_1_P_RST_MASK     (0x100000U)
#define SDADC_FIFO_WR_RD_CTL_WR_1_P_RST_SHIFT    (20U)
/*! WR_1_P_RST - Write Reset for FIFO_1_P */
#define SDADC_FIFO_WR_RD_CTL_WR_1_P_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_WR_1_P_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_WR_1_P_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_RD_1_P_RST_MASK     (0x200000U)
#define SDADC_FIFO_WR_RD_CTL_RD_1_P_RST_SHIFT    (21U)
/*! RD_1_P_RST - Read Reset for FIFO_1_P */
#define SDADC_FIFO_WR_RD_CTL_RD_1_P_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_RD_1_P_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_RD_1_P_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_WR_1_N_RST_MASK     (0x400000U)
#define SDADC_FIFO_WR_RD_CTL_WR_1_N_RST_SHIFT    (22U)
/*! WR_1_N_RST - Write Reset for FIFO_1_N */
#define SDADC_FIFO_WR_RD_CTL_WR_1_N_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_WR_1_N_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_WR_1_N_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_RD_1_N_RST_MASK     (0x800000U)
#define SDADC_FIFO_WR_RD_CTL_RD_1_N_RST_SHIFT    (23U)
/*! RD_1_N_RST - Read Reset for FIFO_1_N */
#define SDADC_FIFO_WR_RD_CTL_RD_1_N_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_RD_1_N_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_RD_1_N_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_WR_2_P_RST_MASK     (0x1000000U)
#define SDADC_FIFO_WR_RD_CTL_WR_2_P_RST_SHIFT    (24U)
/*! WR_2_P_RST - Write Reset for FIFO_2_P */
#define SDADC_FIFO_WR_RD_CTL_WR_2_P_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_WR_2_P_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_WR_2_P_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_RD_2_P_RST_MASK     (0x2000000U)
#define SDADC_FIFO_WR_RD_CTL_RD_2_P_RST_SHIFT    (25U)
/*! RD_2_P_RST - Read Reset for FIFO_2_P */
#define SDADC_FIFO_WR_RD_CTL_RD_2_P_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_RD_2_P_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_RD_2_P_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_WR_2_N_RST_MASK     (0x4000000U)
#define SDADC_FIFO_WR_RD_CTL_WR_2_N_RST_SHIFT    (26U)
/*! WR_2_N_RST - Write Reset for FIFO_2_N */
#define SDADC_FIFO_WR_RD_CTL_WR_2_N_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_WR_2_N_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_WR_2_N_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_RD_2_N_RST_MASK     (0x8000000U)
#define SDADC_FIFO_WR_RD_CTL_RD_2_N_RST_SHIFT    (27U)
/*! RD_2_N_RST - Read Reset for FIFO_2_N */
#define SDADC_FIFO_WR_RD_CTL_RD_2_N_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_RD_2_N_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_RD_2_N_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_WR_3_P_RST_MASK     (0x10000000U)
#define SDADC_FIFO_WR_RD_CTL_WR_3_P_RST_SHIFT    (28U)
/*! WR_3_P_RST - Write Reset for FIFO_3_P */
#define SDADC_FIFO_WR_RD_CTL_WR_3_P_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_WR_3_P_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_WR_3_P_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_RD_3_P_RST_MASK     (0x20000000U)
#define SDADC_FIFO_WR_RD_CTL_RD_3_P_RST_SHIFT    (29U)
/*! RD_3_P_RST - Read Reset for FIFO_3_P */
#define SDADC_FIFO_WR_RD_CTL_RD_3_P_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_RD_3_P_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_RD_3_P_RST_MASK)

#define SDADC_FIFO_WR_RD_CTL_WR_3_N_RST_MASK     (0x40000000U)
#define SDADC_FIFO_WR_RD_CTL_WR_3_N_RST_SHIFT    (30U)
/*! WR_3_N_RST - Write Reset for FIFO_3_N */
#define SDADC_FIFO_WR_RD_CTL_WR_3_N_RST(x)       (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WR_RD_CTL_WR_3_N_RST_SHIFT)) & SDADC_FIFO_WR_RD_CTL_WR_3_N_RST_MASK)

