Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SDADC.h
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_1_N_MASK (0x800U)
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_1_N_SHIFT (11U)
/*! ERR_1_N - Interrupt from FIFO_1_N
 *  0b0..No interrupt
 *  0b1..Interrupt
 */
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_1_N(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WATERMARK_ERROR_ST_ERR_1_N_SHIFT)) & SDADC_FIFO_WATERMARK_ERROR_ST_ERR_1_N_MASK)

#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_P_MASK (0x1000U)
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_P_SHIFT (12U)
/*! ERR_2_P - Interrupt from FIFO_2_P
 *  0b0..No interrupt
 *  0b1..Interrupt
 */
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_P(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_P_SHIFT)) & SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_P_MASK)

#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_N_MASK (0x2000U)
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_N_SHIFT (13U)
/*! ERR_2_N - Interrupt from FIFO_2_N
 *  0b0..No interrupt
 *  0b1..Interrupt
 */
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_N(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_N_SHIFT)) & SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_N_MASK)

#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_P_MASK (0x4000U)
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_P_SHIFT (14U)
/*! ERR_3_P - Interrupt from FIFO_3_P
 *  0b0..No interrupt
 *  0b1..Interrupt
 */
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_P(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_P_SHIFT)) & SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_P_MASK)

#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_N_MASK (0x8000U)
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_N_SHIFT (15U)
/*! ERR_3_N - Interrupt from FIFO_3_N
 *  0b0..No interrupt
 *  0b1..Interrupt
 */
#define SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_N(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_N_SHIFT)) & SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_N_MASK)
/*! @} */

/*! @name FIFO_0_P - FIFO 0 P */
/*! @{ */

#define SDADC_FIFO_0_P_FIFO_0_P_MASK             (0xFFFFFFU)
#define SDADC_FIFO_0_P_FIFO_0_P_SHIFT            (0U)
/*! FIFO_0_P - FIFO_0_P Output Data */
#define SDADC_FIFO_0_P_FIFO_0_P(x)               (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_0_P_FIFO_0_P_SHIFT)) & SDADC_FIFO_0_P_FIFO_0_P_MASK)
/*! @} */

/*! @name FIFO_0_N - FIFO 0 N */
/*! @{ */

#define SDADC_FIFO_0_N_FIFO_0_N_MASK             (0xFFFFFFU)
#define SDADC_FIFO_0_N_FIFO_0_N_SHIFT            (0U)
/*! FIFO_0_N - FIFO_0_N Output Data */
#define SDADC_FIFO_0_N_FIFO_0_N(x)               (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_0_N_FIFO_0_N_SHIFT)) & SDADC_FIFO_0_N_FIFO_0_N_MASK)
/*! @} */

/*! @name FIFO_1_P - FIFO 1 P */
/*! @{ */

#define SDADC_FIFO_1_P_FIFO_1_P_MASK             (0xFFFFFFU)
#define SDADC_FIFO_1_P_FIFO_1_P_SHIFT            (0U)
/*! FIFO_1_P - FIFO_1_P Output Data */
#define SDADC_FIFO_1_P_FIFO_1_P(x)               (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_1_P_FIFO_1_P_SHIFT)) & SDADC_FIFO_1_P_FIFO_1_P_MASK)
/*! @} */

/*! @name FIFO_1_N - FIFO 1 N */
/*! @{ */

#define SDADC_FIFO_1_N_FIFO_1_N_MASK             (0xFFFFFFU)
#define SDADC_FIFO_1_N_FIFO_1_N_SHIFT            (0U)
/*! FIFO_1_N - FIFO_1_N Output Data */
#define SDADC_FIFO_1_N_FIFO_1_N(x)               (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_1_N_FIFO_1_N_SHIFT)) & SDADC_FIFO_1_N_FIFO_1_N_MASK)
/*! @} */

/*! @name FIFO_2_P - FIFO 2 P */
/*! @{ */

#define SDADC_FIFO_2_P_FIFO_2_P_MASK             (0xFFFFFFU)
#define SDADC_FIFO_2_P_FIFO_2_P_SHIFT            (0U)
/*! FIFO_2_P - FIFO_2_P Output Data */
#define SDADC_FIFO_2_P_FIFO_2_P(x)               (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_2_P_FIFO_2_P_SHIFT)) & SDADC_FIFO_2_P_FIFO_2_P_MASK)
/*! @} */

/*! @name FIFO_2_N - FIFO 2 N */
/*! @{ */

#define SDADC_FIFO_2_N_FIFO_2_N_MASK             (0xFFFFFFU)
#define SDADC_FIFO_2_N_FIFO_2_N_SHIFT            (0U)
/*! FIFO_2_N - FIFO_2_N Output Data */
#define SDADC_FIFO_2_N_FIFO_2_N(x)               (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_2_N_FIFO_2_N_SHIFT)) & SDADC_FIFO_2_N_FIFO_2_N_MASK)
/*! @} */

/*! @name FIFO_3_P - FIFO 3 P */
/*! @{ */

#define SDADC_FIFO_3_P_FIFO_3_P_MASK             (0xFFFFFFU)
#define SDADC_FIFO_3_P_FIFO_3_P_SHIFT            (0U)
/*! FIFO_3_P - FIFO_3_P Output Data */
#define SDADC_FIFO_3_P_FIFO_3_P(x)               (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_3_P_FIFO_3_P_SHIFT)) & SDADC_FIFO_3_P_FIFO_3_P_MASK)
/*! @} */

/*! @name FIFO_3_N - FIFO 3 N */
/*! @{ */

#define SDADC_FIFO_3_N_FIFO_3_N_MASK             (0xFFFFFFU)
#define SDADC_FIFO_3_N_FIFO_3_N_SHIFT            (0U)
/*! FIFO_3_N - FIFO_3_N Output Data */
#define SDADC_FIFO_3_N_FIFO_3_N(x)               (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_3_N_FIFO_3_N_SHIFT)) & SDADC_FIFO_3_N_FIFO_3_N_MASK)
/*! @} */

/*! @name FIFO_ENTRIES_AVAIL_0 - FIFO Entries Availability 0 */
/*! @{ */

#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_P_AVAIL_MASK (0x1FU)
#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_P_AVAIL_SHIFT (0U)
/*! FIFO_0_P_AVAIL - Entries Available for FIFO_0_P */
#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_P_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_P_AVAIL_SHIFT)) & SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_P_AVAIL_MASK)

#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_N_AVAIL_MASK (0x1F00U)
#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_N_AVAIL_SHIFT (8U)
/*! FIFO_0_N_AVAIL - Entries Available for FIFO_0_N */
#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_N_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_N_AVAIL_SHIFT)) & SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_N_AVAIL_MASK)

#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_P_AVAIL_MASK (0x1F0000U)
#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_P_AVAIL_SHIFT (16U)
/*! FIFO_1_P_AVAIL - Entries Available for FIFO_1_P */
#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_P_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_P_AVAIL_SHIFT)) & SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_P_AVAIL_MASK)

#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_N_AVAIL_MASK (0x1F000000U)
#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_N_AVAIL_SHIFT (24U)
/*! FIFO_1_N_AVAIL - Entries Available for FIFO_1_N */
#define SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_N_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_N_AVAIL_SHIFT)) & SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_1_N_AVAIL_MASK)
/*! @} */

/*! @name FIFO_ENTRIES_AVAIL_1 - FIFO Entries Availability 1 */
/*! @{ */

#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_P_AVAIL_MASK (0x1FU)
#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_P_AVAIL_SHIFT (0U)
/*! FIFO_2_P_AVAIL - Entries Available for FIFO_2_P */
#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_P_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_P_AVAIL_SHIFT)) & SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_P_AVAIL_MASK)

#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_N_AVAIL_MASK (0x1F00U)
#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_N_AVAIL_SHIFT (8U)
/*! FIFO_2_N_AVAIL - Entries Available for FIFO_2_N */
#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_N_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_N_AVAIL_SHIFT)) & SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_2_N_AVAIL_MASK)

#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_P_AVAIL_MASK (0x1F0000U)
#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_P_AVAIL_SHIFT (16U)
/*! FIFO_3_P_AVAIL - Entries Available for FIFO_3_P */
#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_P_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_P_AVAIL_SHIFT)) & SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_P_AVAIL_MASK)

#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_N_AVAIL_MASK (0x1F000000U)
#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_N_AVAIL_SHIFT (24U)
/*! FIFO_3_N_AVAIL - Entries Available for FIFO_3_N */
#define SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_N_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_N_AVAIL_SHIFT)) & SDADC_FIFO_ENTRIES_AVAIL_1_FIFO_3_N_AVAIL_MASK)
/*! @} */

/*! @name FIFO_INTERRUPT - FIFO Interrupt */
/*! @{ */

#define SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_MASK (0x1U)
#define SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_SHIFT (0U)
/*! FIFO_INTERRUPT - FIFO Interrupt */
#define SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT(x)   (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_SHIFT)) & SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_MASK)

#define SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_EN_MASK (0x2U)
#define SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_EN_SHIFT (1U)
/*! FIFO_INTERRUPT_EN - FIFO Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_EN(x) (((uint32_t)(((uint32_t)(x)) << SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_EN_SHIFT)) & SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_EN_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SDADC_Register_Masks */


/*!
 * @}
 */ /* end of group SDADC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SDADC_H_ */

